#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform
data.archive_file.sre-grafana-lambda: Reading...
data.archive_file.sre-grafana-lambda: Read complete after 0s [id=f5e9d2d8d3b881e26d0350e5dc95f6c13013de00]
aws_sqs_queue.dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/877118445951/sre-grafana-lambda-dlq]
aws_sns_topic.sre-grafana-sns-topic: Refreshing state... [id=arn:aws:sns:eu-west-1:877118445951:sre-grafana-sns-topic]
aws_iam_role.sre-grafana-lambda-role: Refreshing state... [id=sre-grafana-lambda-role]
aws_sns_topic.notification_topic: Refreshing state... [id=arn:aws:sns:eu-west-1:877118445951:sre-grafana-lambda-notifications]
aws_iam_role_policy_attachment.lambda_sqs_send: Refreshing state... [id=sre-grafana-lambda-role-20230409220351816400000001]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=sre-grafana-lambda-role-20230409220351825400000002]
aws_cloudwatch_metric_alarm.dlq_alarm: Refreshing state... [id=sre-grafana-lambda-dlq-alarm]
aws_lambda_function.sre-grafana-lambda: Refreshing state... [id=sre-grafana-lambda]
aws_lambda_permission.sns_invoke_lambda_permission: Refreshing state... [id=AllowExecutionFromSNS]
aws_sns_topic_subscription.sre-grafana-lambda-sns_topic_subscription: Refreshing state... [id=arn:aws:sns:eu-west-1:877118445951:sre-grafana-sns-topic:149cc0c9-945b-46ef-ab99-8ffdd8c921f2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sns_topic_subscription.sns_test_subscription will be created
  + resource "aws_sns_topic_subscription" "sns_test_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "sidejules14@gmail.com"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-1:877118445951:sre-grafana-lambda-notifications"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @juliavpaiva, Action: `pull_request`, Working Directory: `infrastructure/terraform/main`, Workflow: `Plan Terraform Main`*